import React, { Component } from 'react'
import Flag from './flag.jpg';
import { Mycontext } from '../Mycontext/Context';

/*	(١ */

class whyarab extends Component {
    render() {
        return (
            <Mycontext.Consumer>{() =>

                <div className="why-container">
                    <img src={Flag} className="flag" alt="" />
                    <div className="why-div-arab">
                        لماذا الدراسة في اوكرانيا؟
            </div>

                    <div className="why-text-arab">

                        <span className="span-arab"><p className="para-arab1"> ١) جودة التعليم لجميع الطلاب الدوليين</p></span>

                                                       .تتميز الجامعات الأوكرانية بجودة تعليم عالية
الدورات معترف بها دوليًا في أوروبا والمملكة المتحدة والولايات المتحدة وآسيا وأفريقيا ومنظمة الصحة العالمية واليونسكو والمجلس الأوروبي ، إلخ
                                                           هذا يجعل الدبلوم الذي تم الحصول عليه من جامعة أوكرانية ممتازًا في كل مكان في العالم






            <span className="span-arab"><p className="para-arab2">٢) رسوم دراسية منخفضة</p></span>


        الرسوم الدراسية في مؤسسات التعليم العالي الأوكرانية أقل بكثير مما هي عليه في جامعات أوروبا وأمريكا الشمالية.

                                                  علاوة على ذلك ، تقدم أوكرانيا إمكانية دفع الرسوم الدراسية عند الوصول.

                            في الواقع ، لا يرغب العديد من الطلاب في الدفع قبل الوصول ، في أوكرانيا ، يمكنك القيام بذلك.

                              عليك بالتأكيد أن تدفع مقابل خطاب الدعوة والخدمات التي تقدمها الوكالة إذا كنت تستخدمها ،

       ولكن في جميع الحالات ، لن يتم دفع جميع الأموال التي يتعين عليك دفعها إلا بعد وصولك إلى أوكرانيا. ثم أموالك آمنة.





            <span className="span-arab"><p className="para-arab3">٣) معايير الحياة الأوروبية</p></span>

            تقع أوكرانيا في وسط وشرق أوروبا وهي أكبر دولة في أوروبا. أوكرانيا لديها معايير الحياة الأوروبية بأسعار منخفضة. وبالتالي ، فإن هذا البلد مكان جيد لبداية احترافية
                                                                شروط دخول أوكرانيا مرنة جدًا أيضًا للأجانب 






            <span className="span-arab"><p className="para-arab4">٤) إثراء التجربة</p></span>

            هناك عدد كبير من الجامعات لديها شراكة مع جامعات أمريكية وكندا وأوروبية ، مما يجعل فرصتك لمقابلة أساتذة مشهورين من جميع أنحاء العالم بأقل رسوم دراسية.

            علاوة على ذلك ، تقدم الجامعات الأوكرانية لطلابها أماكن إقامة في غرف نوم غير مكلفة              





            <span className="span-arab"><p className="para-arab5">٥) سهولة التسجيل في الجامعات الأوكرانية</p></span>

                .لا يحتاج الطلاب الدوليون إلى اجتياز أي امتحانات تسجيل في إحدى الجامعات الأوكرانية

                ،ليس إلزاميًا أيضًا TOEFL أو IELTS اختبار                                                                           

            </div>

                </div>}
            </Mycontext.Consumer>

        )
    }
}

export default whyarab
