import React, { Component } from 'react'
import { Mycontext } from '../Mycontext/Context';
import Unipic from './uni.jpg';
import Uni1 from './uni1.jpg';
import Uni2 from './uni2.jpg';
import Uni3 from './uni3.jpg';
import Uni4 from './uni4.jpg';
import Uni5 from './uni5.jpg';
import Uni6 from './uni6.jpg';



class Uniarb extends Component {
    render() {
        return (
            <Mycontext.Consumer>{() =>
                <div className="uni-container">
                    <img className="uni-pic" src={Unipic} alt="" />
                    <div className="uni-div-arb" id="Univer">أفضل الجامعات المعروفة في أوكرانيا</div>
                    <img src={Uni1} className="uni1-pic" alt="" />
                    <p className="uni-text">V. N. جامعة كارازين خاركوف الوطنية</p>

                    <div>
                        <p className="uni-about-arb" > :عن الجامعة</p>
                    </div>
                    <p className="uni-about-text-arb">تعد جامعة كارازين خاركيف الوطنية واحدة من أقدم الجامعات في أوروبا الشرقية.
                      تأسست في نوفمبر 1804 ، بمبادرة من المربي البارز  ووفقًا لميثاق القيصر ألكسندر الأول.
                      بدأت الجامعة نظام التعليم العالي بأكمله في منطقة خاركيف. نسلها هي الأكاديمية الوطنية للقانون ،
                      الأكاديمية الصيدلانية الوطنية ، جامعة خاركيف الطبية ، جامعة خاركيف التربوية ، أكاديمية خاركيف البيطرية ، أكاديمية خاركيف للثقافة ،
                           جامعة خاركوف الاقتصادية ومؤسسات التعليم العالي الأخرى.</p>



                    <img src={Uni2} className="uni1-pic" alt="" />
                    <p className="uni-text">جامعة تاراس شيفتشينكو الوطنية في كييف</p>

                    <div>
                    <p className="uni-about-arb" > :عن الجامعة</p>
                    </div>
                    <p className="uni-about-text-arb"> 
                     احتلت جامعة تاراس شيفتشينكو الوطنية في كييف المرتبة الأولى بين 421-430 في تصنيف جامعةالعالمية (بريطانيا العظمى)
                     ,جامعة كييف أكثر نشاطًا في عملية توظيف المواطنين الأجانب 
                     في الوقت الحاضر ، يبلغ عدد الطلاب الأجانب المسجلين في الجامعة 935.
                    تم إعداد برامج التدريب الروسية والإنجليزية لتمكين زيادة عدد الطلاب الدوليين
                    
                    </p>

                    


                    <img src={Uni3} className="uni1-pic" alt="" />
                    <p className="uni-text-2"> "جامعة التقنية الوطنية "معهد خاركيف بوليتكنيك</p>

                    <div>
                    <p className="uni-about-arb" > :عن الجامعة</p>
                    </div>
                    <p className="uni-about-text-arb">
                   «الجامعة التقنية الوطنية «معهد خاركيف بوليتكنيك
                    تأسست عام 1885 هي واحدة من أقدم مؤسسات التعليم العالي التقني 
                    خلال تاريخها الذي يزيد عن 130 عامًا ، أصبحت الجامعة جزءًا لا يتجزأ من العلوم والتقنية ،
                        التاريخ الفكري والثقافي لأوكرانيا اسم الحائز على جائزة نوبل L.D. لانداو وأسماء علماء معروفين في جميع أنحاء العالم مثل الأكاديميين ن.
                        بيكيتوف ، ص. بودنيكوف ، أ.ك.فالتر ، الأطباء الفخريون د. جوكوفسكي ون.
                        الجامعة التقنية الوطنية «معهد خاركيف للفنون التطبيقية» هو مؤسس سبع مؤسسات تعليمية عليا مستقلة ، بما في ذلك جامعة الفضاء الوطنية «معهد خاركيف للطيران» ، وجامعة خاركوف الوطنية للإلكترونيات اللاسلكية ، وجامعة خاركوف الوطنية للهندسة والعمارة ، والجامعة الوطنية الشرقية الأوكرانية (لوهانسك). ) ، ومعهد سومي الفيزيائي والتكنولوجي ، ومعهد كريمنشوك الحكومي للفنون التطبيقية ومعهد كيروفوغراد للهندسة الزراعية.
                      </p>



                    <img src={Uni4} className="uni1-pic" alt="" />
                    <p className="uni-text-2">جامعة التقنية الوطنية في أوكرانيا معهد كييف للفنون التطبيقية</p>

                    <div>
                    <p className="uni-about-arb" > :عن الجامعة</p>
                    </div>
                    <p className="uni-about-text-arb">
                      
                         إنها واحدة من أقدم مؤسسات التعليم العالي المعروفة عالميًا في أوكرانيا ،
                         تدريب المتخصصين ذوي المهارات العالية في مجموعة واسعة من المجالات الأكاديمية لمختلف القطاعات الاقتصادية والاجتماعية في أوكرانيا والدول الأجنبية.
                         تم إعداد حوالي 200000 متخصص خلال تاريخ 120 عامًا من وجودها ، ويتم التدريب في 19 قسمًا تعليميًا ،
                         10 معاهد بحثية تعليمية ، 13 معهد بحثي ، 17 قسمًا علميًا ، أكثر من 32000 طالب ، بما في ذلك رعايا أجانب من 27 دولة يدرسون هنا.
                   
                    </p>




                    <img src={Uni5} className="uni1-pic" alt="" />
                    <p className="uni-text">جامعة ولاية سومي</p>

                    <div>
                    <p className="uni-about-arb" > :عن الجامعة</p>
                    </div>
                    <p className="uni-about-text-arb">

                                                        تأسست في عام 1948   
                      
                  تُصنف جامعة ولاية سومي الأوكرانية ضمن أفضل 100 جامعة في منطقة أوروبا وآسيا الوسطى الناشئة

                    </p>



                        <img src={Uni6} className="uni1-pic" alt="" />
                    <p className="uni-text">جامعة لفيف بوليتكنيك الوطنية</p>

                    <div>
                    <p className="uni-about-arb" > :عن الجامعة</p>
                    </div>
                    <p className="uni-about-text-arb">

                    تأسست عام 1816. تتكون الجامعة من 16 معهدًا و 114 قسمًا. التقسيمات المستقلة والإضافية والعامة.
                    كانت الأكاديمية التقنية من أوائل المدارس الفنية في أوروبا والأولى في أوكرانيا.
                    في عام 1877 تم تغيير اسم الأكاديمية إلى مدرسة البوليتكنيك العليا وأدرجت كمؤسسة تعليمية تقنية عليا للإمبراطورية النمساوية المجرية.  تعد جامعة لفيف بوليتكنيك الوطنية  أقدم مؤسسة للتعليم العالي التقني في أوكرانيا وأوروبا الشرقية.
                    </p>



                </div>
            }</Mycontext.Consumer>

        )
    }
}

export default Uniarb;
