import React, { Component } from 'react'
import Life from './life.jpg';
import Money from './money.jpg';
import Study from './study.jpg';
import Safe from './safe.jpg';
import { Mycontext } from '../Mycontext/Context';









class livearb extends Component {
    render() {
        return (
            <Mycontext.Consumer>{() =>

                <div className="live-container">
                    <img className="life-pic" src={Life} alt="" />

                    <div className="life-div-arb" id="Live-ua">العيش في اوكرانيا</div>

                    <div>
                        <p className="life-text-arb">:الحياة</p>
                    </div>

                    <p className="life-about-arb">
                       أوكرانيا بلد في القارة الأوروبية يقع في أوروبا الشرقية وعاصمتها كييف.
                       لديهم أراضي زراعية واسعة ذات تربة خصبة وهي واحدة من أكبر مصدري الحبوب في العالم.
                       تحدها بولندا وسلوفاكيا والمجر من الغرب وروسيا من الشرق والشمال الشرقي ،
                       بيلاروسيا من الشمال ، ورومانيا ومولدوفا وشبه جزيرة القرم والبحر الأسود من الجنوب.
                       - إصرار الاتحاد السوفيتي على تثقيف جميع مواطني الدولة ،
                       لديهم معدل معرفة القراءة والكتابة بنسبة 99.97 ٪ وهذا هو السبب أيضًا في أن قطاع التعليم جيد على قدم المساواة لكل من مواطني الدولة والطلاب الدوليين.
                       تنتج أوكرانيا رابع أكبر عدد من طلاب الدراسات العليا في أوروبا ، مما يجعل أوكرانيا واحدة من الدول ذات التعليم العالي في القارة.
                    </p>


                    <img className="life-pic" src={Money} alt="" />


                    <div>
                        <p className="life-text2-arb">:نفقات المعيشة</p>
                    </div>

                    <p className="life-about-arb">

                      يعد فهم نفقات المعيشة أمرًا إلزاميًا قبل التقدم بطلب للحصول على الدورات التدريبية في أوكرانيا نظرًا لأن النفقات ،
                      على الرغم من كونه رخيصًا نسبيًا مقارنة بالدول الأوروبية الأخرى ، إلا أنه لا يزال يمثل مبلغًا كبيرًا للطلاب القادمين من أجزاء مختلفة من العالم.
                      من الضروري في هذا البلد تقديم دليل على الملاءة المالية أثناء التقدم للحصول على تأشيرة. غالبًا ما تكون تكلفة المعيشة وصفًا للجامعة التي التحق بها الطالب ونوع نمط الحياة الذي يعيشه.
                    </p>



                    <img className="life-pic" src={Study} alt="" />

                    <div>
                        <p className="life-text3-arb">:اختيار دورة للدراسة</p>
                    </div>

                    <p className="life-about-arb">

                    أوكرانيا بلد معروف بالتسامح والطابع المضياف. يمكن للطلاب الدوليين في أوكرانيا الاندماج بسهولة والاندماج في الثقافة المحلية. النظام التعليمي المعمول به في الدولة موحد ، مما يسهل على الطلاب الدوليين فهمه والتفوق فيه.
                     يمكن للطلاب الاختيار من بين مجالات الدراسة المختلفة حيث يحتوي كل مجال على عدد قليل من الدورات والمواضيع المدرجة من قبل الجامعات. ويشمل ذلك دورات التعليم الهندسي والطب والفني والقانوني. بغض النظر عن الدورات التي يختارها المرء ، سيحصل على أفضل تعليم متاح يلبي جميع متطلبات العمل تقريبًا في الدول الأوروبية ويمكنه بسهولة تزويد الطلاب بفرص عمل.
                     تتبع المؤسسات التعليمية في أوكرانيا إصلاح بولونيا الذي يوفر درجة موحدة ومعترف بها دوليًا.
                    </p>


                    <img className="life-pic" src={Safe} alt="" /> 

                    <div>
                        <p className="life-text4-arb">:مخاوف تتعلق بالسلامة للطلاب الدوليين</p>
                    </div>

                    <p className="life-about-arb">

                    أوكرانيا ، كونها دولة متسامحة ، فهي آمنة لكل من المواطنين والطلاب الدوليين على حد سواء.
                     وضعت الحكومة تدابير السلامة للطلاب من وقت دخولهم البلاد وطوال فترة إقامتهم حتى مغادرتهم. أفضل مدن السلامة هي كييف وخاركيف وأوديسا ولفيف.
                     جعل مركز القبول الأوكراني الرسمي الذي تم إنشاؤه مؤخرًا البلاد أفضل للطلاب الدوليين ككل.
                    </p>

                </div>





            }</Mycontext.Consumer>

        )
    }
}

export default livearb
